<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Android Studio.</string>
    <key>Identifier</key>
    <string>munkitest-hv.pkg.androidstudio</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>Android Studio</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>ParentRecipe</key>
    <string>munkitest-hv.download.androidstudio</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://developer.android.com/studio</string>
                <key>re_pattern</key>
                <string>href="https://[^"]*/([0-9]*\.[0-9]*\.[0-9]*)\.[^"]*/android-studio-ide-[^"]*-mac.dmg"</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
                <key>result_output_var_name</key>
                <string>version</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                <key>app_path</key>
                <string>%pathname%/%NAME%.app</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
