<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads updates for Adobe Acrobat Pro X or XI and copies pkg.</string>
    <key>Identifier</key>
    <string>munkitest-hv.pkg.acrobatdcupdates</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Adobe Acrobat DC Continuous</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>munkitest-hv.download.acrobatdcupdates</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>purge_destination</key>
          <true/>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/unpack</string>
          <key>flat_pkg_path</key>
          <string>%pathname%/*.pkg</string>
        </dict>
        <key>Processor</key>
        <string>FlatPkgUnpacker</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>purge_destination</key>
          <true/>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/payload</string>
          <key>pkg_payload_path</key>
          <string>%RECIPE_CACHE_DIR%/unpack/Payload.pkg/Payload</string>
        </dict>
        <key>Processor</key>
        <string>PkgPayloadUnpacker</string>
      </dict>
  <dict>
        <key>Arguments</key>
        <dict>
          <key>purge_destination</key>
          <true/>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/payload/Extract</string>
          <key>archive_path</key>
          <string>%RECIPE_CACHE_DIR%/payload/MUI.7z</string>
        </dict>
        <key>Processor</key>
        <string>Unarchiver</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Versioner</string>
        <key>Arguments</key>
        <dict>
          <key>plist_version_key</key>
          <string>CFBundleVersion</string>
          <key>input_plist_path</key>
          <string>%RECIPE_CACHE_DIR%/payload/AcroServicesUpdater.app/Contents/Info.plist</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PkgCopier</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
          <key>source_pkg</key>
          <string>%pathname%/*.pkg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PathDeleter</string>
        <key>Arguments</key>
        <dict>
          <key>path_list</key>
          <array>
            <string>%RECIPE_CACHE_DIR%/unpack</string>
            <string>%RECIPE_CACHE_DIR%/payload</string>
          </array>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
