<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of the DisplayLink Manager App.</string>
	<key>Identifier</key>
	<string>munkitest-hv.munki.DisplayLink_Manager</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>DisplayLink Manager</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Utility</string>
			<key>description</key>
			<string>DisplayLink Manager is a new way to enable your DisplayLink dock, adapter or monitor on macOS platforms. It's an application that combines our latest driver with features that streamline the setup of multiple displays up to 4K.</string>
			<key>developer</key>
			<string>DisplayLink Corp.</string>
			<key>display_name</key>
			<string>DisplayLink Manager</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4.0</string>
	<key>ParentRecipe</key>
	<string>munkitest-hv.pkg.DisplayLink_Manager</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
			
			<key>pkg_path</key>
                	<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			<key>version_comparison_key</key>
			<string>DisplayLink Manager</string>	
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
