<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Comment</key>
    <string>Created with Recipe Robot v2.2.1 (https://github.com/homebysix/recipe-robot)</string>
    <key>Description</key>
    <string>Downloads the latest version of Docker Desktop and creates a package. See the download recipe description for information about using the PLATFORM_ARCH input variable to download the Intel/Apple Silicon version of Docker.</string>
    <key>Identifier</key>
    <string>munkitest-hv.pkg.dockerdesktoparm64</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Docker</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.1</string>
    <key>ParentRecipe</key>
    <string>munkitest-hv.download.dockerdesktoparm64</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
        </dict>
        <key>Processor</key>
        <string>AppPkgCreator</string>
      </dict>
    </array>
  </dict>
</plist>
