<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Comment</key>
    <string>Created with Recipe Robot v2.2.1 (https://github.com/homebysix/recipe-robot)</string>
    <key>Description</key>
    <string>Downloads the latest version of Docker Desktop.Acceptable values for PLATFORM_ARCH include:- 'amd64': Downloads the Intel version of Docker. (This is the default.)- 'arm64': Downloads the Apple Silicon version of Docker.NOTE: The Intel build does not function with Rosetta2, so separate packaging isrequired to support Apple Silicon Macs.</string>
    <key>Identifier</key>
    <string>munkitest-hv.download.dockerdesktoparm64</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Docker</string>
      <key>PLATFORM_ARCH</key>
      <string>arm64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.1</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>filename</key>
          <string>%NAME%-%PLATFORM_ARCH%.dmg</string>
          <key>url</key>
          <string>https://desktop.docker.com/mac/main/%PLATFORM_ARCH%/Docker.dmg</string>
        </dict>
        <key>Processor</key>
        <string>URLDownloader</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>input_path</key>
          <string>%pathname%/Docker.app</string>
          <key>requirement</key>
          <string>identifier "com.docker.docker" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "9BNSXJN65R"</string>
        </dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>input_plist_path</key>
          <string>%pathname%/Docker.app/Contents/Info.plist</string>
          <key>plist_version_key</key>
          <string>CFBundleShortVersionString</string>
        </dict>
        <key>Processor</key>
        <string>Versioner</string>
      </dict>
    </array>
  </dict>
</plist>
