<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads latest version of Zoom Client for Meetings</string>
    <key>Identifier</key>
    <string>munkitest-hv.munki.zoomclientformeetings</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Zoom Client for Meetings</string>
      <key>developer</key>
      <string>Zoom</string>
      <key>display_name</key>
      <string>Zoom Client for Meetings</string>
	  <key>name</key>
	  <string>%NAME%</string>
      <key>category</key>
      <string>Social Networking</string>
    </dict>
    <key>ParentRecipe</key>
    <string>munkitest-hv.download.zoomclientformeetings</string>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>FlatPkgUnpacker</string>
        <key>Arguments</key>
        <dict>
          <key>purge_destination</key>
          <true/>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/unpack</string>
          <key>flat_pkg_path</key>
          <string>%pathname%</string>
        </dict>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/payload</string>
          <key>pkg_payload_path</key>
          <string>%RECIPE_CACHE_DIR%/unpack/zoomus.pkg/Payload</string>
        </dict>
        <key>Processor</key>
        <string>PkgPayloadUnpacker</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>input_plist_path</key>
          <string>%RECIPE_CACHE_DIR%/payload/zoom.us.app/Contents/Info.plist</string>
          <key>plist_version_key</key>
          <string>CFBundleShortVersionString</string>
        </dict>
        <key>Processor</key>
        <string>Versioner</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PkgCopier</string>
        <key>Arguments</key>
        <dict>
          <key>source_pkg</key>
          <string>%pathname%</string>
          <key>pkg_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PathDeleter</string>
        <key>Arguments</key>
        <dict>
          <key>path_list</key>
          <array>
            <string>%RECIPE_CACHE_DIR%/unpack</string>
            <string>%RECIPE_CACHE_DIR%/payload</string>
          </array>
        </dict>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
